[BalanceDefs.BD_Iris_Raid_PyroPete_FireTrap InteractiveObjectBalanceDefinition]
DefaultDisplayName=""
Grades[0]=(GradeModifiers=)

[BalanceDefs.BD_Iris_Raid_PyroPete_GrowingFireTrap InteractiveObjectBalanceDefinition]
DefaultDisplayName=""
Grades[0]=(GradeModifiers=)

[Character.CharClass_Iris_Raid_PyroPete AIClassDefinition]
DefaultDisplayName=""
UBMKilledByMessageString=""

[DamageType.DmgType_FireDOT_GasPuddle WillowDamageTypeDefinition]
DamageLanguageId=0,000000

[DamageType.DmgType_FireDOT_HitandStack WillowDamageTypeDefinition]
DamageLanguageId=0,000000

[DamageType.DmgType_FireDOT_Incendiary WillowDamageTypeDefinition]
DamageLanguageId=0,000000

[DamageType.DmgType_FireDOT_ResetStack WillowDamageTypeDefinition]
DamageLanguageId=0,000000

[InteractiveObject.IO_Raid_PyroPete_FuelTank InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[Skills.Skill_FakeCorrosiveStatusEffect SkillDefinition]
SkillName="Piet de Jong"
SkillDescription=""
LockedSkillDetailStr="<Locked>"

[Skills.Skill_FakeFireStatusEffect SkillDefinition]
SkillName="Funny fireplace"
SkillDescription=""
LockedSkillDetailStr="<Locked>"

[Skills.Skill_FireDOT_IncendiaryEffects SkillDefinition]
SkillName="permanent fire hazard"
SkillDescription="burn effect"
LockedSkillDetailStr="<Locked>"

[Skills.Skill_FireDOT_Stacking SkillDefinition]
SkillName="Permanent burn damage"
SkillDescription="Documents"
LockedSkillDetailStr="<Locked>"

[Skills.Skill_FireDOT_Stacking:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description=""
NoConstraintText=""
Suffix=""
Prefix=""

[Skills.Skill_PyroPeteShield SkillDefinition]
SkillName="The enemy's big shield"
SkillDescription="Adjust basic parameters for defenseless enemy targets.."
LockedSkillDetailStr="<Locked>"

[Skills.Skill_Raid_PryroPete_ClearStacks SkillDefinition]
SkillName="Pack it up, Pete"
SkillDescription=""
LockedSkillDetailStr="<Locked>"

[Skills.Skill_WatchAndClearTurretShield SkillDefinition]
SkillName="Destroy the tower"
SkillDescription=""
LockedSkillDetailStr="<Locked>"

[Trap.Iris_Raid_PyroPete_FireTrap InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[Trap.Iris_Raid_PyroPete_GrowingFireTrap InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

